#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudbuild_trigger.build-trigger will be created
  + resource "google_cloudbuild_trigger" "build-trigger" {
      + create_time   = (known after apply)
      + filename      = "cloudbuild/feature-build.yaml"
      + id            = (known after apply)
      + ignored_files = [
          + ".gitignore",
        ]
      + location      = "global"
      + name          = (known after apply)
      + project       = (known after apply)
      + trigger_id    = (known after apply)

      + github {
          + name  = "Continuus"
          + owner = "CPSC319-2022"

          + pull_request {
              + branch = ".*"
            }
        }
    }

  # google_storage_bucket.default will be created
  + resource "google_storage_bucket" "default" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "NORTHAMERICA-NORTHEAST2"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # random_id.bucket_prefix will be created
  + resource "random_id" "bucket_prefix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @itsarune, Action: `pull_request`*